SOAPRequests/Servicerequesttest.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<a:Action s:mustUnderstand="1">http://tempuri.org/ISmartSocketsWebService/GetAllDevices</a:Action>
		<a:MessageID>sevicetest</a:MessageID>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1">https://ent-ml15aaf-1.herts.ac.uk/ServiceImplimentation/Start.svc</a:To>
		<o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="_0">
				<u:Created>2016-05-10T10:20:59.307Z</u:Created>
				<u:Expires>2016-05-10T10:25:59.307Z</u:Expires>
			</u:Timestamp>
			<c:SecurityContextToken u:Id="uuid-f1dfc547-0aa1-436d-b67a-ed66252bf5ec-35" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc">
				<c:Identifier>urn:uuid:991badb3-3e7d-403f-add1-f61ab73ec6ed</c:Identifier>
			</c:SecurityContextToken>
			<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
				<SignedInfo>
					<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
					<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
					<Reference URI="#_0">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
						<DigestValue>uDP0k/JY3/JMjmYCpPT/DS1VrbY=</DigestValue>
					</Reference>
				</SignedInfo>
				<SignatureValue>YZGgyFRrUinhPoLbH8qd9bUomUI=</SignatureValue>
				<KeyInfo>
					<o:SecurityTokenReference>
						<o:Reference URI="urn:uuid:991badb3-3e7d-403f-add1-f61ab73ec6ed" ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/sct" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"></o:Reference>
					</o:SecurityTokenReference>
				</KeyInfo>
			</Signature>
		</o:Security>
	</s:Header>
	<s:Body>
		<GetAllDevices xmlns="http://tempuri.org/"/>
	</s:Body>
</s:Envelope>
